import numpy as np
from scipy import stats
# Задача 1. Случайная непрерывная величина A имеет равномерное распределение на
# промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.

# a = 200
# b = 800
# D = ((b-a)**2)/12
# M = (a+b)/2
# print(f'Среднее значение {round(M,2)}, дисперсия {round(D,2)}')


# Задача 2. О случайной непрерывной равномерно распределенной величине B известно, что ее
# дисперсия равна 0.2.
# Можно ли найти правую границу величины B и ее среднее значение зная, что левая
# граница равна 0.5?
# Если да, найдите ее.

# a = 0.5
# c = np.sqrt(12*0.2)
# b = a + c 
# M = (a + b)/2
# print(c)
# print(f'Правая граница = {round(b,2)}, среднее = {round(M,2)}')

# Задача 3. Непрерывная случайная величина X распределена нормально и задана плотностью
# распределения
# f(x) = (1 / (4 * sqrt(2pi))) * exp((-(x+2)**2) / 32)
# Найдите:
# а). M(X)
# б). D(X)
# в). std(X) (среднее квадратичное отклонение)

# M = -2
# D =  14
# std = np.sqrt(D)
# print(f'M(X) = {M}, D(X) = {D}, std(X) = {round(std,2)}')

# Задача 4. Рост взрослого населения города X имеет нормальное распределение, причем, 
# средний рост равен 174 см, а среднее квадратическое отклонение равно 8 см. посчитайте, 
# какова вероятность того, что случайным образом выбранный взрослый человек имеет рост:
# 1. больше 182 см?
# P(x>182)
# P1 = (182-174)/8
# Z = 0.8413
# P2 = 1 - (stats.norm.cdf(182, loc = 174, scale = 8))
# print('1:')
# print(round((1 - Z),4), round(P2, 4))
# # 2. больше 190 см?
# # P(X>190)
# P1 = (190-174)/8
# Z = 0.97725
# P2 = 1 - (stats.norm.cdf(190, loc = 174, scale = 8))
# print('2:')
# print(round((1 - Z),4), round(P2, 4))
# 3. от 166 см до 190 см?
# P(166<=X<=190)
# P1 = (166-174)/8
# Z1 = 0.1587 
# P1 = stats.norm.cdf(166, loc = 174, scale = 8)
# P2 = (190-174)/8
# Z2 = 0.97725
# P2 = stats.norm.cdf(190, loc = 174, scale = 8)
# print('3:')
# print(round(Z2-Z1,4), round(P2-P1,4))
# 4. от 166 см до 182 см?
# P1 = (166-174)/8
# Z1 = 0.1587 
# P1 = stats.norm.cdf(166, loc = 174, scale = 8)
# P2 = (182-174)/8
# print(P2)
# Z2 = 0.84134
# P2 = stats.norm.cdf(182, loc = 174, scale = 8)
# print('4:')
# print(round(Z2-Z1,4), round(P2-P1,4))
# 5. от 158 см до 190 см?
# P1 = (158-174)/8
# Z1 = 0.0228
# P1 = stats.norm.cdf(158, loc = 174, scale = 8)
# P2 = (190-174)/8
# Z2 = 0.97725
# P2 = stats.norm.cdf(190, loc = 174, scale = 8)
# print('5:')
# print(round(Z2-Z1,4), round(P2-P1,4))
# 6. не выше 150 см или не ниже 190 см?
# P1 = (150-174)/8
# Z1 = 0.0013
# P1 = stats.norm.cdf(150, loc = 174, scale = 8)
# P2 = (190-174)/8
# Z2 = 0.97725
# P2 = stats.norm.cdf(190, loc = 174, scale = 8)
# print('6:')
# print(round(Z2-Z1,4), round(P2-P1,4))
# 7. не выше 150 см или не ниже 198 см?
# P1 = (150-174)/8
# Z1 = 0.0013
# P1 = stats.norm.cdf(150, loc = 174, scale = 8)
# P2 = (198-174)/8
# Z2 = 0.99865
# P2 = stats.norm.cdf(198, loc = 174, scale = 8)
# print('7:')
# print(round(Z2-Z1,4), round(P2-P1,4))
# 8. ниже 166 см?
# P1 = (166-174)/8
# Z1= 0.1587
# P2 = stats.norm.cdf(166, loc = 174, scale = 8)
# print(Z1, round(P2,4))

# Задача 5. На сколько сигм (средних квадратичных отклонений) отклоняется рост человека,
# равный 190 см, от
# математического ожидания роста в популяции, в которой M(X) = 178 см и D(X) = 25 кв.см?

print(f'Отклонение состовляет {(190-178)/5} сигм')